# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.(Сделать для строки)
#  *Пример:*
#  - 6782 -> 23
#  - 0,56 -> 11

number = input('Введите вещественное число: ')
sum = 0
for i in number:
    if i != '.':
        sum += int(i)
print(f'Сумма цифр вещественного числа = {sum}')
