# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
#  и проверяет, является ли этот день выходным.

day_week = int(input('Ведите число дня недели: '))
if 1 <= day_week and day_week <= 5:
    print('Будни')
elif 6 <= day_week and day_week <= 7:  
    print('Выходной') 
else:
    print('Не корректный день недели')      