#Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

number = int(input("Введите число: "))
i = 2
lst = []
while i <= number:
    if number % i == 0:
        lst.append(i)
        number //= i
    else:
        i += 1
print(f"Простые множители приведены в списке: {lst}")