# Вычислить число Пи c заданной точностью d
# Пример:
# - при d = 0.0001,  π = 3.1415    10^-1 ≤ d ≤10^-10

d = int(input('Ведите точность округления числа Пи: '))
k = 1
pi = 0
for k in range(1, 1000000):
    pi = pi+4*((-1)**(k+1))/(2*k-1)
x = str(pi)
print(f'Число Пи = {pi} округлено с точностью до {d} знака после запятой = {x[0:d+2:1]}')
